# vsoStateAddCurrent

## Description
```pascal
FUNCTION vsoStateAddCurrent(
				hObj    : HANDLE;
				message : LONGINT) : LONGINT;
```

```python

def vs.vsoStateAddCurrent(hObj, message):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|message|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events